# Количество различных символов
# На вход программе подается строка текста. Напишите программу, которая определяет количество различных символов в
# строке.

# put your python code here
print(len(set(input())))
