# Информация об учебных курсах
# Напишите программу, которая по номеру курса выводит информацию о данном курсе.

# put your python code here
s = input()
courses = {
    "CS101": "3004, Хайнс, 8:00",
    "CS102": "4501, Альварадо, 9:00",
    "CS103": "6755, Рич, 10:00",
    "NT110": "1244, Берк, 11:00",
    "CM241": "1411, Ли, 13:00"
}

print(f"{s}: {courses[s]}")
