# Количество слов
# Дана строка, состоящая из слов, разделенных пробелами. Напишите программу, которая подсчитывает количество слов в этой
# строке.

# put your python code here
print(len(input().split()))
