# Операции над комплексными числами
# Даны два комплексных числа. Напишите программу, которая вычисляет и выводит их сумму, разность и произведение.

# put your python code here
m, n = complex(input()), complex(input())

print(f"{m} + {n} = {m + n}")
print(f"{m} - {n} = {m - n}")
print(f"{m} * {n} = {m * n}")
